app/controllers/movies_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" IN (1, 2, 3)
SELECT "movies".* FROM "movies"
SELECT "ratings".* FROM "ratings" WHERE "ratings"."movie_id" IN (1, 2, 3, 4)
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3)
---
	def index
		@movies = Movie.includes(:genre, :ratings => [:user]).all